In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("/home/kakashi/Data Analysis Playground/data_analysis_playground/Income - Sheet1.csv",names=["name","income"],skiprows=[0])

In [12]:
df

        name    income
0        Rob     65000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [14]:
df.loc[df['name']=='Rob','income'] = 5000

In [15]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [16]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [17]:
df.income.quantile(0.5) # it give 50th percentile

7000.0

In [18]:
df.income.quantile(1) # it gives 100th percentile

10000000.0

In [20]:
df.income.quantile(0) # it gives 0th percentile

4000.0

In [21]:
df.income.quantile(0.25) # it gives 25th percentile

5500.0

In [22]:
df.income.quantile(0.75) # it gives 75th percentile

7750.0